[{"id":"M.EIC003","title":"Processamento e Recuperação de Informação","students":"6","ects":"6","objectives":"A unidade curricular de PRI tem como objetivo preparar os estudantes para conhecer, compreender, desenhar e desenvolver soluções para o processamento e recuperação de informação. Os objetivos específicos são: Sensibilizar os estudantes para os desafios associados à construção de sistemas de pesquisa de informação; Familiar os estudantes com os principais conceitos e técnicas associadas ao processamento e recuperação de informação; Capacitar os estudantes para desenhar, implementar e avaliar sistemas de pesquisa de informação sobre coleções de documentos.","learning_outcomes":"Ao completar esta unidade curricular, o estudante deve ser capaz de projetar e implementar um sistema para o processamento e recuperação de informação. Em particular, o estudante deve ser capaz de: Identificar e descrever as principais tarefas associadas ao processamento e recuperação de informação; Descrever a arquitetura e funcionamento de um sistema de pesquisa de informação; Descrever as tarefas associadas às fases de processamento de uma coleção (offline) e de processamento de interrogações (online); Distinguir os diferentes modelos de recuperação de informação, identificando os seus princípios, os modelos para a representação de documentos, e as medidas de semelhança; Descrever e implementar diferentes técnicas para a indexação de informação; Descrever e implementar diferentes técnicas para a recuperação e ordenação de resultados;"},{"id":"M.EIC034","title":"Computação Paralela Avançada","students":"0","ects":"6","objectives":"ENQUADRAMENTO A programação paralela e distribuída está a tornar-se o paradigma comum de programação dada a evolução do hardware para arquiteturas multicore e elementos massivamente paralelos como as GPUs. O computador pessoal atual é composto por vários processadores que coletivamente disponibilizam maior capacidade de processamento, do que os anteriores single-core, mas que individualmente têm menor capacidade. Os programadores terão de dominar a programação multi-processador para que possam utilizar com eficiência as máquinas do presente e do futuro. OBJECTIVOS Aquisição de conhecimentos conducentes à utilização simultânea de várias unidades de processamento num sistema de computação. Construção de bases sólidas sobre arquiteturas paralelas, paralelização de algoritmos, modelos de programação, sincronização de processos e medidas de desempenho, através do desenvolvimento de programas. Componente ciêntifica:50% Componente técnica:50%","learning_outcomes":"Os estudantes no final deverão ser capazes de: a) Analisar um problema e identificar o modelo de paralelização mais adequado (Conhecimento e compreensão) b) Escrever programas segundo o modelo de passagem de mensagens e memória partilhada (Análise e Prática) C) Elaborar soluções paralelas para novos problemas (Especificação) D) Utilização de modelos computacionais para estimar o tempo de computação das aplicações (Investigação) E) Conhecimentos de concorrência de processos e implementação de boas práticas para efetuar partilha de recursos (competências transferíveis)."},{"id":"M.EIC047","title":"Web Semântica e Dados Ligados","students":"0","ects":"6","objectives":"ENQUADRAMENTO A unidade curricular \"Linguagens de Anotação e Processamento de Documentos\" tem como contexto o uso generalizado de linguagens de anotação para a representação de informação semi-estruturada e a existência de ferramentas normalizadas para o seu tratamento. A unidade curricular também aborda a noção de Web of Things e integração semântica de dados, como descrição semântica de APIs, Serviços RESTful, e aprendizagem e instanciação de ontologias. OBJETIVOS ESPECÍFICOS 1. Sensibilizar os estudantes para as múltiplas aplicações não triviais das linguagens de anotação; 2. Familiarizar os estudantes com tecnologias de processamento e armazenamento de informação semi-estruturada; 3. Familiarizar os estudantes com as arquitecturas orientadas a serviços e serviços Web; 4. Aprender tecnologias de Semantic Web e instanciação de ontologias; 5. Explorar tecnologias de definição de smart services e IoT, e experiência no desenvolvimento de aplicações.","learning_outcomes":"No final desta unidade curricular o estudante deverá ser capaz de: - Identificar os usos das linguagens de anotação em documentos, em repositórios de dados e no suporte a aplicações; - Criar modelos para documentos XML ; - Distinguir as linguagens normalizadas para domínios de aplicação e os usos ad-hoc da anotação; - Interpretar os resultados do processamento de documentos com as tecnologias baseadas em XML ; - Avaliar comparativamente soluções baseadas em XML e outras para suporte à troca de informação entre aplicações; - Demonstrar conhecimento em JSON; - Utilizar REST-based APIs e processar JSON para obter informação externa mais rica; - Comparar as linguagens de anotação e outras representações de documentos e de dados do ponto de vista da preservação ao longo das mudanças tecnológicas; - Perceber as tecnologias de web semântica e instanciar ontologias; - Conhecer tecnologias de definição de smart services e IoT, e ser capaz de desenvolver aplicações relacionadas; - Desenvolver um protótipo de aplicação envolvendo o processamento de documentos."},{"id":"M.EIC026","title":"Serviços e Aplicações Multimédia","students":"0","ects":"6","objectives":"Esta UC tem por missão fornecer uma perspectiva geral a nível tecnológico sobre a geração, codificação, distribuição e percepção de sinais multimédia. Pretende dotar os estudantes de novos conhecimentos específicos para o processamento e codificação de sinais audiovisuais e consolidar conhecimentos gerais sobre processamento de sinais e redes de computadores para projectar e gerir aplicações e serviços multimédia. Pretender ainda que os estudantes adquiram conhecimentos sobre boas práticas a adoptar na criação de aplicações multimédia interactivas que permitam comunicar de forma eficiente e eficaz informação media, bem como ferramentas para editar, manipular e interligar os dados multimédia.","learning_outcomes":"No final da unidade curricular os estudantes serão capazes de: - identificar as características relevantes dos sinais visuais e sonoros no mundo real. - descrever os conceitos fundamentais para a representação digital e compressão de sinais audio e visuais utilizados em aplicações e serviços multimédia; - compreender a natureza dos sistemas humanos de audição e visão, assim como a sua importância para os modelos de representação, compressão e apresentação eficiente de sinais multimédia. -explicar os fundamentos das principais técnicas genéricas de codificação de fontes media, com e sem perdas. - distinguir e identificar as ferramentas mais utilizadas na compressão dos sinais media -identificar as principais normas internacionais de codificação eficiente de sinais multimédia - explicar as características básicas dos algoritmos usados nessas normas e relacionar com as características dos sinais e do sistema audiovisual humano, assim como com as ferramentas estudadas. - selecionar ferramentas e /ou normas de compressão de acordo com os requisitos da aplicação -identificar requisitos e projetar sistemas de acesso e comunicação de informação multimédia - conhecer e utilizar ferramentas para criação de aplicações multimédia."},{"id":"M.EIC031","title":"Análise e Integração de Dados","students":"0","ects":"6","objectives":"Dotar os alunos da capacidade de projetar, implementar e explorar armazéns de dados (data warehouses).","learning_outcomes":"(1) Planear e gerir o ciclo de vida de um projeto de armazém de dados; (2) Identificar os requisitos e as fontes de dados; (3) Projetar um modelo dimensional adequado; (4) Desenhar e implementar um processo de extração, transformação e carregamento de dados; (5) Especificar e implementar aplicações e modelos de acesso e visualização da informação no armazém de dados; (6) Otimizar o armazém de dados pela criação de agregações e índices; (7) Criar e explorar implementações multidimensionais; (8) Interrogar implementações multidimensionais; (9) Definir os metadados necessários para efeitos de auditoria."},{"id":"M.EIC010","title":"Arquitetura de Sistemas de Software","students":"1","ects":"6","objectives":"À medida que os sistemas de software aumentam de dimensão e de complexidade torna-se cada vez mais importante compreendê-los a níveis de abstracção mais elevados. A arquitectura de um sistema de software descreve a sua estrutura global em termos dos seus componentes, das propriedades externas desses componentes e das suas interrelações. Para sistemas de média e grande dimensão a escolha adequada da arquitectura assume uma importância crucial para o sucesso do seu desenvolvimento. A disciplina de Arquitecturas de Sistemas de Software tem como objectivo principal introduzir os conceitos de arquitecturas de software, padrões de desenho e tópicos directamente relacionados, tais como o de componentes de software. Pretende ensinar a desenhar, compreender e avaliar arquitecturas de sistemas de software, tanto ao nível de abstracção de macro-arquitectura como de micro-arquitectura e assim familiarizar os alunos com os conceitos fundamentais de arquitectura de software, as propriedades e aplicabilidade dos diferentes estilos de arquitectura existentes, os padrões de desenho mais populares, componentes de software, arquitecturas reutilizáveis e as relações destes conceitos todos com a reutilização de software.","learning_outcomes":"No final da disciplina os alunos deverão ser capazes de: • Reconhecer os principais padrões de arquitetura existentes para sistemas de software. • Descrever uma arquitetura de forma precisa. • Idealizar diferentes arquiteturas alternativas para resolver um mesmo problema e avaliar de forma justificada qual é a melhor em função dos atributos de qualidade que suporta. • Reconhecer e compreender diversos padrões de desenho. • Conhecer e aplicar diversos métodos e técnicas de reutilização de software. • Identificar os fatores chave no desenho de arquiteturas de software evoluíveis. • Desenhar um plano de migração entre diferentes tipos de arquitetura. • Construir um sistema de software de média dimensão de acordo com uma especificação de requisitos, selecionando e aplicando padrões de desenho e de arquitetura, usando um método de desenvolvimento baseado em componentes e tecnologias recentes. • Utilizar ferramentas que tornem mais expedita a realização das tarefas de desenvolvimento."},{"id":"M.EIC038","title":"Modelação e Simulação","students":"1","ects":"6","objectives":"Os objectivos da disciplina são: Apresentar os conceitos básicos de modelação e simulação e as suas áreas de aplicação; Apresentar as principais fases do ciclo de vida de um projeto de simulação; Apresentar os principais tipos de modelos e a sua adequação ao tratamento de diferentes problemas; Apresentar os principais aspetos arquiteturais das ferramentas de modelação e simulação; Introduzir ferramentas de modelação e simulação.","learning_outcomes":"Após concluir com sucesso o curso da disciplina, um aluno deverá ser capaz de: Identificar problemas, construir modelos e desenvolver projetos de simulação; Analisar e aplicar resultados de simulação; Incluir técnicas de simulação em diferentes áreas de engenharia e investigação; Demonstrar entendimento das principais áreas de interesse e atuais desafios na área de modelação e simulação; Utilizar ferramentas de modelação e simulação; Projetar e implementar ferramentas e ambientes de simulação para fins específicos ou gerais; Conceber, implementar e avaliar projetos de simulação."},{"id":"M.EIC033","title":"Computação Heterogénea Eficiente","students":"0","ects":"6","objectives":"Esta unidade curricular abrange todos os estágios do projeto de aplicações para sistemas heterogéneos (plataformas heterogéneas de múltiplos núcleos/processadores, GPGPUs e/ou aceleradores  baseados em FPGA). Além do componente de exposição de exemplos e casos de uso, uma componente importante para a aquisição de conhecimento é a execução de um projeto por grupos de estudantes. A exposição dos tópicos e sua prática contribuem decisivamente para permitir que os estudantes alunos se familiarizem com o conjunto de conhecimentos relativos a sistemas heterogéneos. O conteúdo abordado no plano de estudos contribuirá fortemente para as competências descritas.","learning_outcomes":"Descrever e explicar os processos, metodologias e melhores práticas associadas ao desenvolvimento de aplicações no contexto de sistemas de computação heterogéneos de alto desempenho; Descrever e explicar os diferentes estágios do processo para mapear uma aplicação para arquiteturas heterogéneas; Identificar os principais problemas e desafios no mapeamento e otimização de aplicações; Realizar o ajuste de uma aplicação de acordo com requisitos específicos, como desempenho e consumo de energia; Explicar e aplicar um conjunto abrangente de transformações de código fonte a fonte para o mapeamento e ajuste de códigos de aplicações em sistemas heterogéneos de alto desempenho; Descrever e selecionar as ferramentas disponíveis para ajudar a ajustar e mapear uma aplicação para um sistema de computação com vários núcleos heterogéneos / homogéneos; Analisar exemplos de aplicações da vida real para descobrir métodos para mapear e ajustar as suas próprias aplicações."},{"id":"M.EIC044","title":"Técnicas Avançadas de Construção de Software","students":"0","ects":"6","objectives":"Os estudantes devem ser capazes de identificar e aplicar técnicas avançadas de especificação, síntese e manipulação de artefactos executáveis em diferentes fases de desenvolvimento de software, com o intuito de promover atributos de qualidade, tais como confiabilidade, flexibilidade, testabilidade e performance. Em particular, pretende-se reduzir ao máximo o tempo investido a \"programar\", automatizando várias facetas dessa atividade.","learning_outcomes":"Identificar problemas amenos a técnicas de metaprogramação e desenvolvimento automático; Desenhar modelos/meta-modelos específicos de domínio; Processar instanciações de especificações textuais com combinadores de parsing, bem como respectivos mecanismos de execução; Aplicar técnicas de derivação/geração de código/comportamento automaticamente a partir de especificações de alto nível Aplicar técnicas de aprendizagem computacional à construção de código; Depurar programas por especificação incremental de propriedades; Aplicar técnicas de correção automática de programas; Outras técnicas avançadas de desenvolvimento"},{"id":"M.EIC046","title":"Tópicos Avançados de Interação e Multimédia","students":"0","ects":"6","objectives":"1 - INTRODUÇÃO As áreas da Interação e da Multimédia sofrem uma evolução contínua, muitas vezes até de forma disruptiva. Os engenheiros informáticos devem ser capazes de monitorizar os resultados da investigação científica e do  desenvolvimento tecnológico, adequando as suas opções e práticas a essa evolução. 2 - OBJETIVOS ESPECÍFICOS O objetivo desta unidade curricular é transmitir o conhecimento sobre o acompanhamento dos processos de investigação e desenvolvimento em áreas avançadas da Interação e da Multimédia.","learning_outcomes":"1) Adquirir conhecimento estruturados sobre vários tópicos relativos a interação e multimédia. 2) Formar competências em processos de investigação científica. 3) Desenvolver e aprofundar conhecimentos mais específicos em um dos tópicos avançados relativos a interação e multimédia. 4) Aprofundar competências práticas na realização de estudos/tecnologias indispensáveis à realização do trabalho labotatorial. 5) Desenvolver competências na comunicação oral de trabalho realizado"},{"id":"M.EIC028","title":"Tecnologias de Bases de Dados","students":"0","ects":"6","objectives":"Habilitar os estudantes a desenvolver e administrar grandes bases de dados relacionais, nomeadamente através da modelação objeto relacional e da otimização do esquema físico e das interrogações SQL. Habilitar ainda a selecionar e utilizar bases de dados não relacionais, para lidar com problemas que ultrapassam a capacidade dos sistemas relacionais.","learning_outcomes":"O estudante terá competências para: (1) Afinar o esquema físico da BD; (2) Otimizar interrogações SQL; (3) Modelar BD objeto-relacional; (4) Selecionar tipos de sistemas no-SQL; (5) Utilizar bases de dados com modelos de documentos JSON e de grafo; (6) Recuperar e replicar dados."},{"id":"M.EIC009","title":"Agentes e Sistemas Multi-Agente","students":"0","ects":"6","objectives":"A unidade curricular assume-se como de Engenharia (evidenciando apenas a teoria essencial para se entender as aplicações práticas) e proporciona uma perspetiva global das técnicas associadas à computação baseada em agentes, explorando, por um lado, a modelação e simulação de sistemas complexos baseadas em agentes computacionais, e também o desenvolvimento de aplicações de agentes inteligentes e de sistemas multi-agente com capacidade de adaptação. A Programação e a Engenharia de Software Orientada a Agentes são apresentadas como uma nova metáfora para a descrição e programação de sistemas computacionais distribuídos. Os conhecimentos adquiridos serão consolidados através da utilização de ferramentas de software apropriadas, com as quais os estudantes são incentivados a elaborar pequenos projetos de desenvolvimento. O objetivo principal é que os estudantes saibam especificar e implementar sistemas complexos, adaptativos, distribuídos e descentralizados usando o paradigma dos sistemas multi-agente.","learning_outcomes":"No final da unidade curricular, os estudantes deverão ser capazes de: Modelar sistemas complexos recorrendo a agentes computacionais Projetar sistemas distribuídos e descentralizados seguindo o paradigma dos sistemas multi-agente Desenvolver agentes de software inteligentes, seguindo diferentes arquiteturas Avaliar a execução de uma simulação baseada em agentes ou de um sistema multi-agente distribuído Desenvolver sistemas multi-agente com mecanismos de adaptabilidade"},{"id":"M.EIC021","title":"Otimização","students":"0","ects":"6","objectives":"Dotar os estudantes com competências para: identificar e abordar de forma hábil e estruturada problemas de decisão; construir modelos de problemas de decisão; identificar e recorrer a métodos analíticos para obtenção de soluções para os modelos construídos, como suporte para decisões fundamentadas; usar solvers de otimização para análise e obtenção de soluções para os modelos construídos.","learning_outcomes":"No final desta unidade curricular, os alunos devem ser capazes de: - Identificar um problema de decisão; - justificar a necessidade de aplicação de uma técnica de optimização; - Construir um modelo matemático apropriado; - Selecionar e aplicar corretamente um método/algoritmo adequado; - Ser capaz de analisar criticamente os resultados obtidos; - Aplicar análise de sensibilidade; - Ser capaz de justificar e quantificar os ganhos para a organização. O objetivo principal desta UC é, através da criação de modelos, desenvolver competências para análise de um conjunto vasto de situações reais. Essas competências baseiam-se na capacidade de reconhecer o problema-chave numa situação não estruturada e desenvolver uma estrutura para analisar e tratar o problema, e na aplicação de métodos analíticos na sua resolução. Atendendo a que Otimização é a UC base da Investigação Operacional e  à definição de Investigação Operacional disponível no sítio da internet da Sociedade de Investigação Operacional do Reino Unido, encontramos um emparelhamento perfeito desta UC científica com os objetivos declarados: “Operational research is the discipline of applying advanced analytical methods to help make better decisions. By using techniques such as problem structuring methods […] and mathematical modeling to analyze complex situations, operational research gives executives the power to make more effective decisions and build more productive systems”."},{"id":"M.EIC001","title":"Aprendizagem Computacional","students":"9","ects":"6","objectives":"Com a digitalização crescente dos seus processos, as organizações (empresas, governo, etc.) sentem agora a necessidade de extrair conhecimento desses dados, que permita melhorar a eficiência e eficácia desses processos (por ex. para ganhar vantagem competitiva). Para esse fim, as organizações precisam de adquirir competências técnicas, para o desenvolvimento de soluções baseadas em abordagens standard de Aprendizagem Computacional (AC ou machine learning) e Extração de Conhecimento de Dados (ECD ou data mining), mas também de competências científicas para o desenvolvimento de soluções inovadoras para os problemas em que essas abordagens standard não existem. Assim, os objetivos desta U.C. são: Motivar para a utilização de técnicas de AC/ECD no apoio à decisão. Desenvolver a capacidade de utilizar corretamente essas técnicas para análise automática de grandes quantidades de dados. Desenvolver a capacidade de realizar investigação científica para desenvolver novas abordagens de AC/ECD. Distribuição percentual Componente científica: 70% Componente tecnológica: 30%","learning_outcomes":"Pretende-se que os estudantes: Conheçam os vários tipos de tarefas de ECD. Identifiquem problemas de apoio à decisão que possam ser representados como tarefas de ECD. Conheçam os principais métodos/algoritmos para as tarefas mais comuns de ECD e compreendam o essencial do seu funcionamento. Apliquem corretamente esses métodos na realização de um projeto de ECD, seguindo uma metodologia adequada. Avaliem de forma adequada os resultados de um projeto de ECD. Identifiquem oportunidades de desenvolvimento de novas abordagens de AC/ECD. Desenvolvam trabalho científico simples, mas adequado para criação de novas abordagens de AC/ECD."},{"id":"M.EIC006","title":"Laboratório de Gestão de Projetos","students":"2","ects":"6","objectives":"1- ENQUADRAMENTO O sucesso dos projetos e produtos de software depende não só do domínio das competências técnicas necessárias à realização das várias atividades do ciclo de vida do desenvolvimento do software, mas também, e cada vez mais, de um conjunto de capacidades e competências de gestão, comportamentais e comunicacionais, tais como competências de gestão de projeto (nas suas diversas variáveis de prazo, orçamento, âmbito, qualidade, recursos, etc.), capacidade de trabalhar em equipa, capacidade de relacionamento com clientes e capacidade de comunicação e marketing. 2- OBJETIVOS ESPECÍFICOS No final da Unidade Curricular os estudantes deverão ser capazes de: 1.Identificar a necessidade de recurso à gestão de projetos bem como a importância do seu enquadramento estratégico; 2.Identificar os diferentes referenciais normativos e metodologias para a gestão de projetos; 3.Identificar e definir as áreas de processo e variáveis da gestão de projetos; 4. Aplicar metodologias e ferramentas de gestão de projeto e trabalho em equipa; 5. Aplicar conceitos e ferramentas de gestão da qualidade a projetos; 6. Identificar e gerir os riscos inerentes a um projeto. 3- CONHECIMENTO PRÉVIO Domínio das competências técnicas necessárias ao desenvolvimento de projetos de software. Ter frequentado com aproveitamento Laboratório de Desenvolvimento de Software (LDSO). 4- DISTRIBUIÇÃO PERCENTUAL Componente Científica: 50% Componente Tecnológica 50%","learning_outcomes":"Desenvolver nos estudantes as capacidades de gestão de projectos de software, trabalho em equipa e empreendedorismo, habilitando-os assim a resolver a diversidade de problemas que tipicamente surgem em projectos deste tipo numa organização real."},{"id":"M.EIC032","title":"Bases de Dados Não Relacionais","students":"0","ects":"6","objectives":"A unidade curricular de BDNR tem como objetivo preparar os estudantes para conhecer, compreender, projetar e desenvolver, soluções baseadas em paradigmas e tecnologias de bases de dados não relacionais para o suporte de sistemas de informação. Objetivos específicos: conhecer e compreender os principais conceitos e paradigmas das bases de dados não relacionais; capacitar os estudantes para a análise, desenho, implementação e avaliação de bases de dados não relacionais; projetar a componente de armazenamento e de interrogação de sistemas assentes em modelos não relacionais.","learning_outcomes":"Após completar a UC o estudante deverá ser capaz de: Reconhecer as situações em que as bases de dados relacionais não constituem a solução adequada para o armazenamento e interrogação dos dados; Identificar e descrever os diversos modelos de bases de dados não relacionais e as situações típicas de utilização de cada um deles; Projetar, implementar e interrogar bases de dados construídas segundo as diversas abordagens não relacionais; Analisar os desafios associados a cenários complexos de grande escala (big data), propor soluções baseadas em modelos não relacionais e compreender os limites de cada uma delas; Combinar modelos relacionais e não relacionais em sistemas de informação."},{"id":"M.EIC029","title":"Visão por Computador","students":"0","ects":"6","objectives":"A visão por computador é uma área da ciência da computação focada na extracção de \"informação útil\" de imagens e vídeos. O objectivo da visão por computador é \"descobrir a partir de imagens o que está presente no mundo, onde estão localizadas as coisas, que acções estão a ser executadas\" (Marr,1982). Exemplos de \"informação útil\" incluem, por exemplo, o cálculo da geometria 3D de um objecto presente numa imagem, a detecção e identificação de faces ou de gestos humanos, o seguimento de pessoas ou de veículos numa sequência de vídeo. Os algoritmos da visão por computador têm imensas aplicações em muitas áreas, desde a industrial, militar ou médica até à sempre crescente área do entretenimento. Este curso é uma introdução aos conceitos e métodos da visão por computador, adaptada aos estudantes do MIEIC que pretendam prosseguir investigação nesta área. Os principais tópicos a tratar incluem: o processo de formação de imagens, métodos básicos de processamento e análise de imagem, bem como métodos mais avançados de reconstrução 3D de uma cena, análise de movimento, aprendizagem automática / deep learning e reconhecimento de objectos.","learning_outcomes":"Os estudantes que concluírem este curso com sucesso deverão: compreender e ser capazes de explicar os conceitos da visão por computador e os algoritmos fundamentais de manipulação de imagens e sequências de vídeo; conhecer e ser capazes de aplicar esses algoritmos em situações práticas; adquirir conhecimentos que lhes permitam usar uma biblioteca, como a OpenCV, que implementa alguns dos algoritmos estudados, e implementar novos algoritmos descritos na literatura; ser capazes de analisar e compreender artigos científicos seleccionados nas áreas de processamento e análise de imagem e de visão por computador."},{"id":"M.EIC024","title":"Segurança de Redes","students":"0","ects":"6","objectives":"A segurança das comunicações e da infraestrutura de redes, serviços, e sistemas de computadores é de importância crítica para a segurança das aplicações, dos utilizadores, da informação, e -- com a massificação da internet das coisas -- das próprias ‘coisas’. O objetivo desta UC é dar a conhecer ao estudante 1) as limitações dos protocolos, serviços, sistemas, e infraestrutura de comunicação face a um adversário motivado bem como 2) algumas das soluções existentes para mitigar ou evitar o impacto destas limitações.","learning_outcomes":"No final desta unidade curricular, o estudante deverá: 1) conhecer conceitos transversais de segurança como CIA e diferentes modelos de ameaça e saber aplicá-los a diferentes redes e sistemas; 2) conseguir identificar e explorar vulnerabilidades conhecidas em redes e sistemas a vários níveis da pilha protocolar e em vários sistemas e aplicações, através de métodos passivos e ativos incluindo ataques man-in-the-middle; 3) conseguir identificar e desenhar mecanismos de segurança de redes e sistemas nomeadamente a nível da arquitetura da rede, controlo de acesso, filtragem, deteção de intrusões, e redes virtuais privadas (VPN); 4) conseguir desenvolver e analisar aplicações que usem protocolos de comunicação baseados em criptografia; 5) conseguir explorar de forma autónoma tópicos novos de segurança através da análise de artigos científicos e relatórios, e da sua aplicação em laboratório."},{"id":"L.EIC021","title":"Fundamentos de Segurança Informática","students":"0","ects":"6","objectives":"Esta Unidade Curricular tem como objetivo fornecer aos estudantes uma perspetiva integrada dos fundamentos da segurança informática; visa dotar os estudantes de uma visão abrangente dos aspetos de segurança inerentes ao desenvolvimento e operação de sistemas informáticos, contextualizando problemas e soluções tecnológicas específicas para tecnologias abordadas em outras Unidades Curriculares do Ciclo de Estudos.","learning_outcomes":"Conhecer os princípios da construção de programas e sistemas informáticos seguros. Aprender a pensar sobre sistemas informáticos como um atacante. Compreender como se identificam ameaças a um sistema informático e como se avalia a sua relevância. Reconhecer limitações e justificar medidas de proteção de um sistema informático. Explicar como diversos tipos de ataques funcionam na prática."},{"id":"M.EIC039","title":"Modelos de Negócio para a Economia Digital","students":"2","ects":"6","objectives":"Após a aprovação nesta unidade curricular, os estudantes deverão ser capazes de desenvolver e analisar novos modelos de negócio em áreas estabelecidas e emergentes da economia digital, mobilizando os conceitos e características fundamentais desta área da economia.","learning_outcomes":"Após a aprovação nesta unidade curricular, os estudantes deverão ser capazes de: 1.Recordar os conceitos e características fundamentais da economia digital. 2. Utilizar esses conceitos e características no desenvolvimento e análise de novos modelos de negócio da economia digital. 3. Recordar as principais características, tipologias e fatores de sucesso de modelos de negócio assentes em plataformas, “as a service”, e assentes em dados e informação. 4. Utilizar estes conhecimentos para analisar áreas de negócio relacionadas com a economia digital, combinando um entendimento dos principais aspetos tecnológicos e de negócio em jogo. 5. Recordar o estado e as perspetivas de desenvolvimento, e o potencial de impacto de tecnologias emergentes na economia digital. 6. Aplicar estes conhecimentos para analisar as implicações de tecnologias emergentes para a mudança em áreas estabelecidas e emergentes da economia digital."},{"id":"M.EIC017","title":"Gestão de Redes e Sistemas","students":"0","ects":"6","objectives":"A comoditização das redes, serviços, e sistemas e o aumento do seu tamanho e complexidade mesmo em organizações de pequena a média dimensão, e a necessidade de adaptação rápida a mudanças da organização, a novas versões de software, a falhas, ou a ataques, torna impraticável a sua gestão e operação manual e aproxima a gestão e operação de redes e serviços do modelo devops seguido no desenvolvimento de software para a cloud numa lógica de infraestrutura programável. O objetivo desta UC é dar a conhecer ao estudante 1) os conceitos fundamentais da gestão e operação da rede, serviços, e sistemas de uma organização pequena a média, bem como 2) as técnicas de programação para a automatização da gestão e operação dessas redes, serviços, e sistemas.","learning_outcomes":"No final desta unidade curricular, o estudante deverá: 1) conseguir explicar e discutir mecanismos de gestão, controlo, e operação de redes incluindo alocação de recursos em redes e monitorização; 2) compreender os conceitos fundamentais das operações de rede, serviços e sistemas de uma organização pequena a média; 3) conseguir aplicar técnicas de programação para automatizar a gestão e operação de rede, serviços, e sistemas; 4) conseguir explicar e discutir os conceitos fundamentais de virtualização de funções de rede (NFV) e de rede definida por software (SDN)."},{"id":"M.EIC043","title":"Sistemas Ciberfísicos e Internet das Coisas","students":"0","ects":"6","objectives":"1. Entender tendências atuais de CPS e IoT: • Descrever casos de uso típicos e diferenciar seus requisitos de sistema. • Explicar o impacto potencial no desenvolvimento de sistemas em larga escala. 2. Compreender arquiteturas, modelos de computação e princípios de infra-estrutura: • Definir diferentes elementos de arquitetura. • Discutir motivação para cada elemento arquitetural e modelo de computação. 3. Conhecer as plataformas, arquiteturas e protocolos: • Explicar vantagens e desvantagens da conectividade sem fios. • Distinguir diferentes tecnologias sem fios comuns e suas principais características. • Diferenciar plataformas e protocolos. • Explicar papel do modelo publicação-subscrição. 4. Descrever as questões relacionadas com confiabilidade, segurança e privacidade. 5. Projetar e implementar sistemas baseados em CPS e IoT combinando diferentes componentes. 6. Comparar diferentes soluções de projeto para sistemas CPS e IoT. 7. Analisar, projetar, implementar e documentar sistemas CPS e IoT.","learning_outcomes":"Esta unidade curricular aborda diferentes arquiteturas, modelos de computação, técnicas e ferramentas aplicáveis no desenvolvimento de sistemas ciberfísicos. Embora exista nesta unidade curricular uma componente de exposição, de exemplos e casos, a transmissão de conhecimento processa-se maioritariamente através da execução de projetos por grupos de estudantes. A exposição destes tópicos e respetiva prática contribuem decisivamente para permitir aos estudantes familiarizar-se com o corpo de conhecimento relacionado com os sistemas ciberfísicos e internet das coisas. Os conteúdos abordados no tópico 1 contribuem para os OAs 1, 5 e 6. Os conteúdos abordados nos tópicos 2, 3 e 5 são transversais e contribuem para as competências descritas em todos os OAs. O tópico 4 contribui para os OAs 1, 3, 5 e 7. Finalmente, o tópico 6 oferecerá uma visão dos desenvolvimentos de investigação e inovação, contribuindo para os OAs 1, 2, 5, 6 e 7."},{"id":"M.EIC025","title":"Segurança em Sistemas Informáticos","students":"0","ects":"6","objectives":"Esta Unidade Curricular tem por âmbito o estudo da problemática de segurança de sistemas Informáticos, de forma a fornecer aos estudantes um painel básico dos conceitos e das ameaças e defesas de uma utilização abusiva e destrutiva de tais sistemas.","learning_outcomes":"No final desta unidade curricular, os estudantes com aprovação deverão ser capazes de: - descrever os conceitos fundamentais da segurança de sistemas informáticos; - especificar uma política de segurança para um sistema típico e saber selecionar os mecanismos adequados à sua implementação e controlo de cumprimento; - analisar um canal de comunicação típico e identificar os principais níveis de proteção que lhe estão associados ou de que carece; - estudar, programar e operar alguns dispositivos ou técnicas de segurança em situações reais."},{"id":"M.EIC023","title":"Programação em Lógica com Restrições","students":"0","ects":"6","objectives":"Esta Unidade Curricular (UC) aborda os paradigmas da Programação em Lógica (PL) e Programação com Restrições (PR), especificamente na Programação em Lógica com Restrições (PLR). O paradigma da PL apresenta uma abordagem declarativa à programação, baseada em processos formais de raciocínio, mais apropriada para a resolução de alguns tipos de problemas. PLR permite abordar problemas de satisfação de restrições e de otimização de forma eficiente, modelizando-os de uma forma direta e elegante.","learning_outcomes":"No final da UC, os estudantes deverão: - Estar familiarizados com os paradigmas da programação declarativa, nomeadamente PL e PLR. - Identificar as categorias de problemas em que a PL e PLR são particularmente adequadas. - Possuir capacidades de raciocínio abstrato e de resolução de problemas de forma declarativa. - Ser capazes de aplicar adequadamente técnicas de PL e PLR. - Ser capazes de construir aplicações completas usando Prolog com ou sem restrições."},{"id":"M.EIC016","title":"Gestão de Empresas e Empreendedorismo","students":"0","ects":"6","objectives":"A unidade curricular tem por objetivo desenvolver competências na área da Gestão e Empreendedorismo, integrando uma sólida componente teórica, baseada na apresentação e discussão de conceitos e metodologias, com a sua aplicação à análise e à discussão de casos de estudo.","learning_outcomes":"No final da unidade curricular, os estudantes devem ser capazes de: 1. Compreender o papel do gestor e da gestão na empresa, bem como a sua evolução. 2. Compreender e explorar as tecnologias de informação como elemento potenciador da Gestão. 3. Compreender o papel das áreas funcionais de gestão e a forma como se interligam na estratégia da empresa. 4. Aplicar um conjunto de conceitos, métodos e ferramentas de Gestão nas áreas financeira, de marketing, operações e estratégia para analisar problemas, identificar alternativas e tomar decisões de gestão. 5. Aplicar os métodos e ferramentas da Gestão à análise de empresas e identificação de melhorias. 6. Recordar e caracterizar os componentes de um modelo de negócio e a forma como se articulam para criar, entregar e capturar valor. 7. Aplicar as ferramentas conceptuais do ponto anterior para desenvolver e analisar modelos de negócio e estratégias empreendedoras."},{"id":"M.EIC020","title":"Marketing","students":"0","ects":"6","objectives":"A unidade curricular tem por objectivo desenvolver competências na área da Gestão de Marketing, integrando uma sólida componente teórica, baseada na apresentação e discussão de conceitos e metodologias, com a sua aplicação ao desenvolvimento de um plano de marketing e à discussão de casos de estudo.","learning_outcomes":"No final da unidade curricular, os estudantes devem ser capazes de: 1. Compreender o papel do Marketing na gestão das organizações; 2. Compreender e aplicar os principais conceitos e instrumentos de Marketing ao desenvolvimento de estratégias e planos de Marketing nas organizações. 3. Compreeender e aplicar os conceitos de Marketing à gestão do relacionamento com os clientes. 4. Utilizar os conceitos e intrumentos do Marketing para apoiar o desenvolvimento e oferta de produtos e serviços de base tecnológica. 5. Utilizar os conceitos e intrumentos de Marketing para compreender os factores de mercado. 6. Ser capazes de desenvolver trabalho em equipa."},{"id":"M.EIC027","title":"Sistemas Embutidos e de Tempo Real","students":"0","ects":"6","objectives":"- Capacidade para identificar requisitos funcionais e não funcionais de sistemas embarcados, com ênfase no requisitos temporals - Capacidade para modelar aplicações de sistemas embarcados de tempo-real expondo o máximo de concorrência - Capacidade para utilizar ferramentas de desenvolvimento de sistemas embarcados de tempo-real - Capacidade para definir e utilizar plataformas computacionais programáveis basedas em micro-controladores com sistemas operativos de tempo-real - Capacidade para projetar e construir sistemas embarcados de tempo-real utilizando os modelos, as ferramentas e as plataformas referidos acima."},{"id":"M.EIC040","title":"Realidade Virtual e Aumentada","students":"0","ects":"6","objectives":"Realidade Aumentada é uma tecnologia através da qual se pretende melhorar ou aumentar a visão que um utilizador tem do mundo real com imagens virtuais, usando técnicas de Visão por Computador e de Computação Gráfica. Por outro lado, a Realidade Virtual procura envolver o utilizador real num ambiente totalmente virtual fazendo-o crer que está noutro mundo. O principal objetivo desta disciplina é transmitir aos estudantes um conjunto de conhecimentos básicos destas técnicas, que lhes permitam prosseguir estudos mais avançados na área emergente da Realidade Aumentada bem como na Realidade Virtual, e a capacidade de realizar pequenos trabalhos ilustrativos das metodologias estudadas.","learning_outcomes":"No final, os estudantes deverão ser capazes de: - identificar e caraterizar os componentes, a estrutura e as funções de um sistema mínimo de realidade virtual e/ou aumentada; - descrever os algoritmos principais usados na implementação de cada um dos componentes; - descrever como interagem os diversos componentes; - realizar a integração entre imagens do mundo real e imagens de objetos virtuais; - desenvolver aplicações de Realidade Aumentada e Virtual, recorrendo a uma biblioteca disponível (ARToolkit, Vuforia, kudan, VRTK). - desenvolver técnicas avançadas recorrendo a bibliotecas de visão por computador (OpenCV)."},{"id":"M.EIC002","title":"Desenvolvimento de Software de Larga Escala","students":"5","ects":"6","objectives":"A unidade curricular tem como objectivo principal desenvolver nos estudantes as seguintes competências: Aplicação de um processo ágil a todo o ciclo de vida de um sistema de software real de complexidade e escala média-elevada. Utilização de práticas de desenvolvimento ágil. Utilização de ferramentas para automação e suporte às práticas usadas durante todo o seu ciclo de vida, desde os requisitos até à utilização. Utilização de infraestruturas e serviços de software de grande escala, para desenvolvimento e instalação de soluções com forte integração de componentes e aplicações. Desenvolvimento de trabalho colaborativo integrando diversos intervenientes (equipa, clientes, especialistas externos), promovendo negociação e decisões partilhadas sobre o projeto. Consolidação dos conhecimentos e competências anteriormente adquiridos em diversas disciplinas relacionadas com desenvolvimento de software, em especial: Engenharia de Software, Bases de Dados e Interfaces com o Utilizador.","learning_outcomes":"Os estudantes serão capazes de definir e aplicar um processo de desenvolvimento de um sistema de software de média-larga escala, utilizando práticas ágeis, ferramentas tipicas de desenvolvimento de software, num ambiente multi-equipa."},{"id":"M.EIC004","title":"Sistemas Distribuídos de Larga Escala","students":"5","ects":"6","objectives":"Os objetivos principais da unidade curricular incluem: - a aquisição de conhecimento sobre sistemas distribuídos de larga escala - a aquisição de experiência de desenvolvimento de sistemas distribuídos de larga escala.","learning_outcomes":"Após conclusão com sucesso desta unidade curricular, os estudantes deverão ser capazes de: reconhecer e explicar a relevância da distribuição e de modelos de coordenação na escalabilidade de sistemas informáticos. reconhecer e caracterizar os desafios em sistemas distribuídos em termos de problemas e modelos abstratos identificar e discutir o papel de algoritmos distribuídos na solução de problemas de escala e de disponibilidade identificar e discutir o papel de algoritmos distribuídos na tolerância a falhas de sistemas de grande escala conceber aplicações/serviços de larga escala a partir duma especificação de requisitos implementar e avaliar serviços e aplicações distribuídos que resolvem problemas de grande escala em ambientes particionáveis e/ou de elevada latência identificar e compreender o estado da arte na área de sistemas distribuídos"},{"id":"M.EIC012","title":"Computação Móvel","students":"0","ects":"6","objectives":"A computação móvel tem tido um enorme incremento nos últimos anos com a explosão da utilização de dispositivos móveis de elevadas capacidades de computação, comunicação, armazenamento e interface. As aplicações estendem-se por cada vez mais campos desde o entretenimento e redes sociais até ao trabalho empresarial. Os objectivos principais desta unidade curricular visam a aquisição de conhecimento e prática dos conceitos essenciais do projecto, arquitectura e implementação de aplicações, principalmente empresariais, em dispositivos móveis, utilizando APIs de grande divulgação corrente. São problemas e desafios a vencer a grande diversidade de capacidades e formas de interação dos dispositivos móveis atuais.","learning_outcomes":"Os estudantes, no final desta unidade curricular, deverão ser capazes de, dada uma especificação de requisitos para aplicações disponíveis 'em qualquer altura e em qualquer lugar': - escolher uma plataforma móvel, padrão da aplicação, 'framework' de programação, adequação às características dos dispositivos e necessidades de armazenamento e comunicação; - escolher as tecnologias mais apropriadas, tendo em vista o cenário da aplicação; - desenvolver e realizar aplicações e serviços locais e remotos necessários, nas principais tecnologias, com interface adequada; - integrar serviços e aplicações disponíveis, mesmo quando realizados em diferentes tecnologias."},{"id":"M.EIC015","title":"Estruturas de Dados e Algoritmos Avançados","students":"0","ects":"6","objectives":"Esta unidade curricular (UC) tem por objetivo complementar e aprofundar conhecimentos previamente assimilados em UCs de 1º ciclo sobre conceção e análise de algoritmos e estruturas de dados, cobrindo um espectro adicional de técnicas de conceção e análise de algoritmos e estruturas de dados mais avançadas, apropriadas a problemas mais complexos.","learning_outcomes":"No final da unidade curricular, os estudantes devem ser capazes de: Compreender o mapeamento de problemas complexos do mundo real para soluções algorítmicas (e.g., problemas em grafos, problemas geométricos, programação linear, etc.); Selecionar e aplicar estruturas de dados avançadas (e.g., árvores-kd) e técnicas algorítmicas (e.g., randomização, aproximação, paralelização) para resolver problemas do mundo real; Conceber algoritmos eficientes para resolver um problema em questão; Reconhecer algumas classes de problemas intratáveis e aplicar algoritmos de aproximação para os resolver; Selecionar e aplicar técnicas avançadas de análise de algoritmos (e.g., amortizada, probabilística, etc.); Avaliar os algoritmos do ponto de vista da eficiência e correção, tanto analítica como experimentalmente."},{"id":"M.EIC041","title":"Robótica Inteligente","students":"3","ects":"6","objectives":"Compreender os conceitos básicos de Robótica e o enquadramento da Inteligência Artificial na Robótica. Estudar métodos de perceção e interpretação sensorial (com ênfase na visão por computador) que permitam criar estados do mundo precisos e métodos de localização de robôs móveis. Estudar os métodos que permitam a robôs móveis navegarem em ambientes conhecidos ou desconhecidos usando algoritmos de Planeamento e Navegação. Estudar os fundamentos da interação humano-robô, da aprendizagem para robôes, robótica cooperativa e da construção de equipas de robôs. Analisar as principais competições robóticas nacionais e internacionais, os simuladores robóticos mais realistas e as plataformas robóticas mais avançadas disponíveis no mercado. Incentivar capacidade de comunicação em tópicos técnicos. Incentivar abordagens científicas saudáveis.","learning_outcomes":"Espera-se que, no final da UC, os estudantes sejam capazes de: Definir Autonomia em Sistemas Robóticos Definir Sistemas Robóticos Inteligentes Explicar o enquadramento da Inteligência Artificial em Sistemas Robóticos Inteligentes Identificar as aplicações da Robótica Inteligente Identificar e utilizar as Arquiteturas clássicas para controlo em Robótica Conhecer o Estado da Arte em Sistemas Robóticos Inteligentes Conhecer os sensores e atuadores mais comuns utilizados em robótica e métodos de interpretação sensorial Avaliar a utilização de sistemas de visão comparativamente a outros métodos Aplicar métodos de fusão sensorial, métodos do âmbito da Inteligência Artificial e métodos de processamento de sinal e de visão para construir Estados do Mundo Aplicar métodos de localização,  mapeamento, planeamento e navegação em robótica Conhecer e utilizar uma ou mais plataformas robóticas e/ou de simulação robótica Conhecer e utilizar metodologias de interacção, aprendizagem e cooperação para robótica."},{"id":"M.EIC007","title":"Preparação da Dissertação","students":"0","ects":"4,5","objectives":"1. ENQUADRAMENTO A unidade curricular \"Preparação de Dissertação\" acompanha o processo de organização e trabalho preliminar da dissertação do Mestrado Integrado em Engenharia Informática e Computação. Os estudantes completam PDIS antes do semestre em que a dissertação é realizada a tempo inteiro. O esforço da unidade é o equivalente a 6 ECTS (1/5 de semestre a tempo inteiro) e é dedicado à escolha e familiarização com o tema da dissertação, ao estudo do estado da arte no domínio da dissertação e à realização de trabalho preliminar. Após PDIS, espera-se que o trabalho no semestre da dissertação seja intenso, bem focado e com boa apresentação de resultados. 2. OBJETIVOS ESPECÍFICOS Familiarizar-se com os processos, metodologias e práticas associados à investigação científica, tomando como exemplo a investigação em engenharia informática; Refletir sobre o pensamento crítico e sobre a sua aplicação nas ciências; Selecionar um tema e questões de investigação apropriadas a uma dissertação; Elaborar e apresentar o plano de um projecto de dissertação, incluindo o respectivo estado da arte, em tema a selecionar.","learning_outcomes":"No final desta unidade curricular o estudante deverá ser capaz de: Interpretar uma proposta de trabalho de investigação, refiná-la e descrevê-la; Num tema de investigação escolhido, pesquisar e selecionar publicações em bases de dados de publicações científicas e outros tipos de publicação; Descrever o processo de divulgação científica e de publicação de resultados, incluindo a preparação de manuscritos, a avaliação e o registo de publicações; Escolher métodos de investigação apropriados para a engenharia informática; Elaborar um plano de trabalhos e um calendário para a dissertação de mestrado; Escrever um estudo de trabalhos relacionados para um tema de investigação, com base na pesquisa bibliográfica; Comunicar resultados de investigação e apresentar o trabalho realizado na preparação da dissertação de mestrado."},{"id":"M.EIC035","title":"Engenharia de Linguagens de Software","students":"0","ects":"6","objectives":"Esta unidade curricular pretende preparar os estudantes para o desenho e implementação de linguagens de software, nomeadamente de linguagens de programação e de modelação (visuais ou textuais) e com ênfase em linguagens específicas de domínio (DSLs). A UC inclui as etapas de engenharia de linguagens software, desde conceitos, requisitos, desenho, até à implementação e geração de código. Serão focados os parsers generalizados, ferramentas e técnicas para alcançar implementações rápidas e incrementais. Durante a UC, os estudantes trabalharão na engenharia de uma DSL, à qual aplicarão os conhecimentos adquiridos.","learning_outcomes":"Os estudantes serão capazes de: O1: compreender todas as etapas da Engenharia de linguagens de software O2: usar ferramentas contemporâneas para implementar linguagens de software O3: aplicar os conceitos na Engenharia de uma nova linguagem de software O4: implementar geradores de código eficientes O5: identificar e aplicar as práticas que resultam em resultados eficientes"},{"id":"M.EIC037","title":"Métodos Formais para Sistemas Críticos","students":"0","ects":"6","objectives":"Esta unidade curricular tem como objetivo geral familiarizar os estudantes com o desenvolvimento de sistemas críticos e como utilizar técnicas de especificação e verificação formal para aumentar a qualidade e confiabilidade de sistemas de software.","learning_outcomes":"No final da unidade curricular os estudantes devem ser capazes de: Identificar os principais conceitos e técnicas associados ao desenvolvimento e certificação de sistemas críticos (\"safety critical\") baseados em software. Identificar os principais conceitos e técnicas de especificação e verificação formal de sistemas baseados em software e reconhecer a sua importância e aplicabilidade. Aplicar métodos de verificação formal por \"model checking\" na concepção de sistemas de software reativos de pequena e média complexidade com suporte de ferramentas. Aplicar métodos de verificação formal por prova de teoremas a sistemas de software sequenciais de pequena e média complexidade com suporte de ferramentas."},{"id":"M.EIC022","title":"Processamento de Linguagem Natural","students":"0","ects":"6","objectives":"Esta unidade curricular fornece uma introdução à área do Processamento de Linguagem Natural (PLN). No final da mesma, os estudantes devem ter adquirido uma compreensão abrangente da área e do seu estado da arte, bem como tendências de investigação recentes.","learning_outcomes":"Os objetivos de aprendizagem incluem: Adquirir os conceitos linguísticos fundamentais relevantes para o processamento de texto em linguagem natural. Entender os algoritmos e as técnicas básicas e do estado da arte para lidar com texto em linguagem natural. Familiarizar-se com as ferramentas e os recursos linguísticos mais avançados em PLN. Compreender e empregar métricas de avaliação para diferentes tarefas da PLN. Ser capaz de formular um problema de classificação em PLN e resolvê-lo com as técnicas, algoritmos e ferramentas apropriados. Ler e compreender investigação atual sobre processamento de linguagem natural."},{"id":"M.EIC005","title":"Sistemas Gráficos Interativos","students":"4","ects":"6","objectives":"ENQUADRAMENTO Esta unidade curricular surge na sequência de \"Computação Gráfica\", do segundo semestre do segundo ano, onde foram dados a conhecer os principais princípios teóricos da matéria. OBJETIVOS ESPECÍFICOS Esta unidade curricular tem por objectivo principal desenvolver um conjunto de competências práticas, algumas já tratadas em unidades curriculares anteriores num contexto mais teórico. Foca-se em trabalhos práticos de desenvolvimento, tendencialmente multidisciplinares, nomeadamente nas áreas de Computação Gráfica e Interfaces, de Programação em Lógica e de Sistemas Operativos. DISTRIBUIÇÃO PERCENTUAL Componente científica: 30% Componente tecnológica: 70% Pretende-se dotar os alunos de capacidade de exploração adequada ao desenvolvimento de software, nomeadamente na criação de ambientes 3D (representação poligonal, iluminação e interacção) e na utilização dos serviços oferecidos por um sistema operativo, com ênfase especial em comunicações e sincronização.","learning_outcomes":"No fim da unidade curricular os estudantes devem ser capazes de: - Projectar aplicações e respectivas estruturas, adequadas à utilização em tecnologia de síntese deimagem, - Conceber, desenvolver e avaliar aplicações com interface gráfica 3D recorrendo a uma tecnologia adequada de síntese de imagem, - Integrar código desenvolvido em ambientes e linguagens de natureza diferente, utilizando tecnologias de comunicação."},{"id":"M.EIC030","title":"Análise de Projetos de Investimento","students":"0","ects":"6","objectives":"O objetivo desta disciplina é dotar os alunos do conhecimento das metodologias base para a análise da viabilidade económica e financeira de projetos de investimento.","learning_outcomes":"Pretende-se que no final do curso os alunos estejam aptos a fundamentar a tomada de decisões de Investimentos Reais nas empresas e saibam elaborar um Plano de Negócios."},{"id":"M.EIC036","title":"Engenharia de Software Seguro","students":"0","ects":"6","objectives":"Pretende-se que os estudantes: 1. Reconheçam os problemas de segurança do software de sistemas de computação, suas causas e consequências, e conheçam as boas práticas para a sua prevenção, deteção e mitigação; 2. Conheçam e sejam capazes de aplicar as boas práticas do desenvolvimento de software seguros nas fases do ciclo de vida do software: captura de requisitos, arquitetura e desenho, implementação, verificação e validação, distribuição, instalação e manutenção; 3. Conheçam e sejam capazes de usar processos e ferramentas de engenharia de software direcionados para questões de segurança; 4. Conheçam normas relevantes para o desenvolvimento de software seguro. Os conteúdos programáticos incluem as abordagens estado da arte em segurança de software e as técnicas conferentes da capacidade de selecionar de forma crítica os métodos apropriados. Incluem ainda a interpretação e análise do comportamento de algoritmos e resultados, bem como ferramentas ‘ off-the-shelf’ .","learning_outcomes":"O conteúdo programático, incidindo nas bases conceptuais, processos da engenharia do software com a inclusão contínua das preocupações de segurança, ameaças e vulnerabilidades frequentes, incluindo problemas na arquitetura das aplicações, código e linguagens de programação em si, identificação e autorização nas aplicações distribuídas e na web, e utilização incorreta ou vulnerável de protocolos de acesso remoto, assim como alguns detalhes e exemplos práticos de análise e desenho, é visivelmente consentâneo com os objetivos da unidade curricular, cujo principal é a aquisição de práticas que conduzam a software e sistemas computacionais seguros."},{"id":"M.EIC013","title":"Desenho e Desenvolvimento de Jogos Digitais","students":"0","ects":"6","objectives":"1 - INTRODUÇÃO Os engenheiros informáticos podem tirar grandes vantagens em possuir competências no desenvolvimento de jogos digitais, não só como produto final da indústria do entretenimento, mas também pelas capacidades imersiva e de interatividade desta tecnologia, que podem potenciar, inclusivamente, a aprendizagem. 2 - OBJETIVOS ESPECÍFICOS O objetivo desta unidade curricular é transmitir o conhecimento sobre o processo de desenvolvimento de jogos de computador, com ênfase particular nos aspetos relacionados com a programação dos diversos módulos que compõem um motor de jogo. 3 - DISTRIBUIÇÃO PERCENTUAL Componente científica: 30% Componente tecnológica: 70%","learning_outcomes":"No final da unidade curricular o estudante será capaz de: Identificar as diversas fases do projeto de um jogo de computador e todas as competências envolvidas; Aplicar técnicas de programação de jogos de computador nas suas várias vertentes; Selecionar os algoritmos e as técnicas de programação que melhor se adequam à especificação e design de um jogo de computador; Desenvolver, programar ou estender os diversos módulos que compõem um motor de jogo. Desenvolver o projeto de um jogo de computador, enquadrando-se numa equipa multidisciplinar."},{"id":"M.EIC045","title":"Teste, Verificação e Validação de Software","students":"1","ects":"6","objectives":"Familiarização com a terminologia usada em teste de software. Conhecer e saber aplicar as técnicas principais de teste para controlo de qualidade de software.","learning_outcomes":"No final da unidade curricular os estudantes deverão conhecer os conceitos de teste de software, as técnicas de conceção de casos de teste e quando as usar, e conhecer e saber aplicar as diferentes ferramentas de teste de software existentes."},{"id":"M.EIC014","title":"Engenharia de Requisitos","students":"0","ects":"6","objectives":"Dotar os alunos com competências para planear, gerir e levar a cabo um processo de análise e especificação de requisitos de um sistema de software.","learning_outcomes":"Ao serem aprovados à unidade curricular, os estudantes serão capazes de: - definir requisito de um sistema de informação e explivcar a sua importância - explicar a importância do processo de engenharia de requitos no sucesso de um sistema de informação - descrever o processo de engenharia de requisitos de um sistema de informação - identificar e explicar os papéis e actores no processo de engenharia de requisitos - descrever a aplicação na engenharia de requisitos das técnicas de análise de problemas - explicar como se usam e aplicar as técnicas de workshops de requisitos e prototipagem - aplicar as técnicas de cenários e storyboarding e observação e análise social (métodos etnográficos) - explicar em que consiste e qual a importância da análise de requisitos - descrever as técnicas de análise de requisitos - explicar a importância da classificação de requisitos - classificar requisitos quanto a prioridade e risco - explicar a necessidade e importância da negociação de requisitos - negociar requisitos - descrever as várias formas de representação de requisitos - descrever a estrutura básica de um documento de requisitos - estruturar a descrição dos requisitos de um sistema segundo a norma IEEE 830-1998 - construir modelos de casos de uso simples a partir de uma descrição de requisitos - elaborar um documento de requisitos completo."},{"id":"M.EIC042","title":"Seminários","students":"0","ects":"6","objectives":"Objetivos: Apresentar tópicos, tecnologias e metodologias emergentes em engenharia informática não abordados noutras unidades curriculares; Apresentar tópicos, tecnologias e metodologias específicas para clusters e setores de atividade relevantes (ex, automóvel e de transportes, financeiro, da saúde, etc.); Apresentar desafios societais que podem ser resolvidos com recurso às tecnologias digitais ou que são suscitados por essas tecnologias.","learning_outcomes":"No final da UC os estudantes deverão ser capazes de: Identificar, descrever e demonstrar familiaridade com alguns tópicos, tecnologias e metodologias emergentes em Engenharia Informática e Computação, não abordados noutras unidades curriculares; Identificar, descrever e demonstrar familiaridade com algumas Tecnologias de Informação e Comunicação específicas para clusters e setores de atividade relevantes (automóvel e de transportes, financeiro, da saúde, etc.), não abordadas noutras unidades curriculares; Identificar, descrever e demonstrar familiaridade com alguns desafios societais que podem ser resolvidos com recurso às tecnologias digitais ou que são suscitados por essas tecnologias, bem como demonstrar capacidade para idealizar soluções tecnológicas, organizacionais e de negócio para endereçar esses desafios."},{"id":"M.EIC008","title":"Dissertação","students":"1","ects":"30","objectives":"Nos termos do estipulado em normas específicas da FEUP, a caracterização de Dissertação é a seguinte: Trabalho individual de investigação e desenvolvimento, conducente à elaboração de uma dissertação de natureza científica sobre um tema da área de conhecimento do curso, ou visando a integração e aplicação à resolução de problemas complexos de engenharia de conhecimentos, competências e atitudes adquiridos ao longo do curso. Pode ser um trabalho de investigação ou de desenvolvimento tecnológico e aplicação, envolvendo meios experimentais e/ou de simulação, que promova o desenvolvimento de capacidades de iniciativa, de decisão, de inovação, de pensamento criativo e crítico, num contexto de trabalho individual ou em grupo. Deve envolver a análise de situações novas, a recolha de informação pertinente, o desenvolvimento e selecção ou concepção das metodologias de abordagem e dos instrumentos de resolução do problema proposto, a sua resolução, o exercício de síntese e elaboração de conclusões, e a preparação de uma dissertação pertinente sujeita a apresentação pública e discussão dos resultados. Pode ser realizado em ambiente académico ou académico e empresarial. Neste caso os objectivos, natureza e forma de acompanhamento do trabalho devem ser objecto de acordo prévio entre o estudante e os orientadores por parte da Faculdade e da empresa, validado pelo Director do Curso, que garanta a satisfação dos objectivos de natureza científica e pedagógica da unidade curricular, e proteja eventuais questões de confidencialidade por parte da empresa/instituição de acolhimento.","learning_outcomes":"Trabalho individual de investigação e desenvolvimento, conducente à elaboração de uma dissertação de natureza científica sobre um tema da área de conhecimento do curso, ou visando a integração e aplicação à resolução de problemas complexos de engenharia de conhecimentos, competências e atitudes adquiridos ao longo do curso. O trabalho pode ser de investigação ou de desenvolvimento tecnológico e aplicação, envolvendo meios experimentais e/ou de simulação, que promova o desenvolvimento de capacidades de iniciativa, de decisão, de inovação, de pensamento criativo e crítico, num contexto de trabalho individual ou em grupo."},{"id":"M.EIC019","title":"Gestão de Sistemas de Informação","students":"0","ects":"6","objectives":"O principal objetivo desta UC é dar uma visão geral das atividades, métodos, técnicas e desafios no planeamento estratégico de informação e TI/SI nas organizações no contexto de transformação digital. Envolve a seleção, o uso e a gestão de sistemas e tecnologias da informação como instrumentos para implementar estratégias de negócio.","learning_outcomes":"Após a conclusão da UC, os estudantes serão capazes de: 1. Explicar os desafios e os requisitos para gerir a função de SI, incluindo recursos humanos, serviços, modelos de sourcing, recursos de dados e informação, arquiteturas empresariais e estruturas de governança de TI; 2. Aplicar os principais métodos e técnicas para desenvolver aptidões digitais inovadoras, através da análise estratégica da informação e TI/SI, da gestão de portfólios, projetos e programas de SI; 3. Desenvolver, implementar e gerir um programa estratégico de gestão de informação que atenda aos requisitos organizacionais de gestão da informação e TI/SI, conformidade, gestão de risco e privacidade e segurança."}]
